app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "director", "release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Alien"], ["rating", "G"], ["director", ""], ["release_date", "2014-10-22 00:00:00.000000"], ["created_at", "2019-10-22 06:19:49.431338"], ["updated_at", "2019-10-22 06:19:49.431338"]]

  def searchByDirector
    movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT 1  [["id", 1]]

  def searchByReleasedDate
    @type=params[:type]
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE (release_date > '2000-06-21 00:00:00.000000')